# SQLite


- **SQLite and Python types**
- **Connection Establishment with Database**
- **Table Creation and Data Insertion**
- **Some Data Filtering Operation**
- **Table Drop**

# SQLite and Python types

None      NULL
int       INTEGER
float     REAL
str       TEXT
bytes     BLOB

### Connection Establishment with Database

In [83]:
import sqlite3
db=sqlite3.connect('company_database1.db')

In [84]:
c=db.cursor()

In [85]:
c.execute('CREATE TABLE company2(ID int UNIQUE , Name text, Age int, Address text, Salary real)')

In [86]:
c.execute('INSERT INTO company2 VALUES(1,"rohit",12,"Banglore",100000.00)')
c.execute('INSERT INTO company2 VALUES(2,"kavisha",20,"Ahmedabad",110000.00)')
c.execute('INSERT INTO company2 VALUES(3,"riya",28,"Rajkot",111000.00)')

In [87]:
db.commit()

In [88]:
data=c.execute('SELECT * FROM company2')
for i in data:
    print(i)

(1, 'rohit', 12, 'Banglore', 100000.0)
(2, 'kavisha', 20, 'Ahmedabad', 110000.0)
(3, 'riya', 28, 'Rajkot', 111000.0)

In [89]:
# Insert a row of data
c.execute("INSERT INTO company2(ID, Name, Age, Address, Salary) VALUES (4, 'Venkat', 42, 'Chennai', 400000.00)")

c.execute("INSERT INTO company2(ID, Name, Age, Address, Salary) VALUES (5, 'Raju', 31, 'Madurai', 400000.00)")

c.execute("INSERT INTO company2(ID, Name, Age, Address, Salary) VALUES (6, 'Ankit', 25, 'Bangalore', 800000.00)")

c.execute("INSERT INTO company2(ID, Name, Age, Address, Salary) VALUES (7, 'Ravi', 25, 'Bangalore', 800000.00)")

c.execute("INSERT INTO company2(ID, Name, Age, Address, Salary) VALUES (8, 'Shivam', 25, 'Bangalore', 800000.00)")

In [90]:
db.commit()

In [91]:
db.close()

# Some Data Filtering Operation

In [92]:
db=sqlite3.connect('company_database1.db')
c=db.cursor()

In [94]:
d=c.execute("SELECT Name from company2  WHERE Address ='Bangalore'" )
for i in d:
    print(i)

('Ankit',)
('Ravi',)
('Shivam',)

In [96]:
data=c.execute("select * from company2 where Salary >100000")
for x in data:
    print(x)

(2, 'kavisha', 20, 'Ahmedabad', 110000.0)
(3, 'riya', 28, 'Rajkot', 111000.0)
(4, 'Venkat', 42, 'Chennai', 400000.0)
(5, 'Raju', 31, 'Madurai', 400000.0)
(6, 'Ankit', 25, 'Bangalore', 800000.0)
(7, 'Ravi', 25, 'Bangalore', 800000.0)
(8, 'Shivam', 25, 'Bangalore', 800000.0)

In [99]:
data=c.execute('select ID ,Name from company2 order by Age ASC')
for x in data:
    print(x)

(1, 'rohit')
(2, 'kavisha')
(6, 'Ankit')
(7, 'Ravi')
(8, 'Shivam')
(3, 'riya')
(5, 'Raju')
(4, 'Venkat')

In [100]:
data=c.execute("select ID, Name, Age from company2 order by Age desc")
for x in data:
    print(x)

(4, 'Venkat', 42)
(5, 'Raju', 31)
(3, 'riya', 28)
(6, 'Ankit', 25)
(7, 'Ravi', 25)
(8, 'Shivam', 25)
(2, 'kavisha', 20)
(1, 'rohit', 12)

# Table Drop

In [101]:
# importing sqlite
import sqlite3

#connecting with the database.
db = sqlite3.connect("food_database.db")
c = db.cursor()

# Create table to store food name and their colories
c.execute('CREATE TABLE food(Name text, Calories int)') 

# Insert a row of data
c.execute("INSERT INTO food VALUES ('Mango', 60)")
c.execute("INSERT INTO food VALUES ('Samosa',262)")

In [102]:
data=c.execute("SELECT * FROM food")
for i in data:
    print(i)

('Mango', 60)
('Samosa', 262)

In [103]:
## Its recommended to use this DROP command
c.execute("DROP table IF EXISTS food")

In [104]:
## Checking its deleted or not
c.execute("DROP table food")

OperationalError: no such table: food

In [ ]:
c.ex